openpapaya/AMBAR/CTP_MSP430F5529/CTP_MSP430F55229.c

#include <msp430.h>
#include <stdint.h>
#include <stdlib.h>
#include <stdio.h>
#include <math.h>
#include <string.h>

#include "libs/config_gpio_5529.h"
#include "libs/config_i2c_5529.h"
#include "libs/config_timers_5529.h"
#include "libs/ambar_ultrassom_5529.h"
#include "libs/ambar_uart_5529.h"
#include "libs/ambar_lcd_5529.h"
#include "libs/ambar_timers_5529.h"
#include "libs/ambar_valvulas_5529.h"
#include "libs/funcoes_ina219_5529.h"
#include "libs/funcoes_DS18B20_5529.h"
#include "libs/funcoes_PCF8574_5529.h"
#include "libs/ambar_comESP32_5529.h"

// If you have to write comments, do not write about what the code is doing.
// Instead, write about why the code is doing what it's doing.
// Write comments that you would want to read five years from now
// when you've forgotten everything about this code.
// And the fate of the world is depending on you. No pressure.

//                              *** ENDERECOS I2C ***
// PCF8574 - CONTROLE DAS VALVULAS      - Endereco: 0x20
// PCF8574 - SENSORES DE NIVEL E RELES  - Endereco: 0x21
// PCF8574 - LCD                        - Endereco: 0x27
// INA219  - Leitor Tensao/Corrente     - Endereco: 0x40
// ESP32   - Cliente MQTT               - Endereco: 0x42

#define      PCF8574_valves  0x20
#define      PCF8574_sNivel  0x21
#define      ESP32           0x42
#define      INA219          0x40
#define      PCF8574_LCD1    0x27
#define      PCF8574_LCD2    0x26

//Variaveis Gobais
char fromESP32[1];                 // Menssagem vinda do cliente ESP32 para os tanques principais
char toESP32[1];                   // Menssagem vinda do preparador de nutrientes para o ESP32
extern uint8_t TXESP32Data;
extern uint8_t TXByteCtr;
extern volatile char stringToEsp32[10];
volatile unsigned int prepNutSendingTo_T1;
volatile unsigned int prepNutSendingTo_T2;
volatile uint8_t flagP1IES;
// Sensor de temperatura
volatile uint8_t flag_temp;
volatile uint8_t flag_SU1;
volatile uint8_t flag_SU2;
//volatile unsigned int flag_SU;
volatile unsigned int flag_LCD;
volatile unsigned int flag_regT1_ok;
volatile unsigned int flag_regT2_ok;
volatile unsigned int flag_1_sec;
volatile unsigned int flag_5_sec;
volatile unsigned int flagTvalve;
volatile unsigned int atualizarUart;
volatile unsigned int flag_milisec;
volatile unsigned int rotina_Inicial;
volatile unsigned int menu_entraEsai;
volatile unsigned int opcoesMenu;
// Vindas de ambar_valvulas_5529
extern volatile uint8_t flag_regT1ok;
extern volatile uint8_t flag_regT2ok;
// Variaveis vindas de uartAmbar5529
extern uint8_t flagOpCmd;
extern uint8_t flagOpCmd_UCA0;
// Variaveis vindas de ambar_lcd_5529
extern volatile uint8_t atualizarLCD;
// Variaveis vindas de ambar_ultrassom_5529
extern volatile unsigned int s1_Ultra;
extern volatile unsigned int s2_Ultra;
// Variaveis para tratar da comunicacao com o ESP32


// Variaveis vindas de ambar_uart_5529
extern volatile uint8_t flag_softDog;
extern volatile uint8_t countExit;
extern volatile uint8_t flagClrBuff;
//
extern volatile unsigned int t1_closeRegIN, t2_closeRegIN, t1_closeRegOUT, t2_closeRegOUT;             // Solicitaeheho de fechamento e abertura de vehlvulas
extern volatile unsigned int t1_openRegIN, t2_openRegIN, t1_openRegOUT, t2_openRegOUT;             // Solicitaeheho de fechamento e abertura de vehlvulas


//Protehtipo das funcoes
void gpioConfig();                           //Chama a Funcao io_config, para que o GPIO seja configurado
void lcdInit();
void lcdWriteByte(uint8_t addr, uint8_t byte, uint8_t instr0char1);
void i2cConfig();
void ta0Config(void);                       //Funcao que configura o Timer A0.
void tb0Config(void);                       //Funcao que configura o Timer b0.
void monNivelAB_1_2(void);                  // inicializacao dos tanque 1 e 2
void operador_T1_T2(void);                  //
uint8_t sNivel(void);            // Tratamento de rebotes do SU e dos sensores de nehvel do tanque 1
void rebotesPorta2(void);                   // Tratamento de rebotes do SU e dos sensores de nehvel do tanque 1
void operador_botaoCapacitivo(void);
void evapTimer_T1(void);                    // Contador do tempo de evaporacao do tanque 1
void evapTimer_T2(void);                    // Contador do tempo de evaporacao do tanque 2
void operador_LCD(uint8_t addr);            //
void operador_SU(void);
void uartConfig();
void uart_operador_ambar5529();
void uartWrite_UCA0(volatile char * str );
void uartMonitorAmbar();
void ta2_ultrassom_config(void);            //
void tb0_ultrassom_config(void);            //
uint8_t read_temp();
void serial_esp32();

//                              *** ENDERECOS I2C ***
// PCF8574 - CONTROLE DAS VALVULAS  - Endereco de escrita: 0x20       Endereco de leitura: 0x41
// PCF8574 - SENSORES DE NIVEL      - Endereco de escrita: N/A (0x42) Endereco de leitura: 0x43
// PCF8574 - LCD                    - Endereco de escrita: 0x27       Endereco de leitura: ?
// INA219  - Leitor Tensao/Corrente - Endereco de escrita: 0x40       Endereco de leitura: 0x40
//*************************************************************
// Sensores de nivel conectados as portas P7(A1), P6(B1), P5(A2) e P4(B2) da PCF
//*************************************************************
//  ---------- MAPEAMENTO ENTRE A PCF8574 DO DECOTER E A FUNCAO "i2cWriteByte" ------------
//  |       P1  P2  P3  P4  P5  P6  P7
//  |       0b 7   6   5   4   3   2   1
//  |
//*************************************************************
//      - Configuration After Reset -
// 1. Initialize Ports: PxDIR, PxREN, PxOUT, and PxIES
// 2. Clear LOCKLPM5
// 3. If not wake-up from LPMx.5: clear all PxIFGs to avoid erroneous port interrupts
// 4. Enable port interrupts in PxIE
//**************************************************************
int  main(void)
{
    WDTCTL = WDTPW            |               // Senha (PW) do watchdog timer
            // WDTPW          |               // Modo: Intervalo
            // WDTSSEL__ACLK  |               // Clock: ACLK
            // WDTIS__32K;                    // Intervalo: 1 segundo
            WDTHOLD;   // stop watchdog timer
    // PM5CTL0 = ~LOCKLPM5;
    volatile int i;
    rotina_Inicial = 0;
    flagP1IES = 0;
    flag_temp = 5;
    flag_SU1 = 2;
    flag_SU2 = 0;

