openpapaya/AMBAR/CTP_MSP430F5529/CTP_MSP430F55229.c
    // __low_power_mode_0();                // Esse modo de baixo consumo nao desliga o ACLK
    gpioConfig();                           // Chama a funcao io_config, para que o GPIO seja configurado
    __enable_interrupt();
    //    i2cConfig();                            // Funcao que configura a comunicaeheho I2C
    i2cWriteByte_UCB1(PCF8574_valves, 0b11111111 ); // Desativa todos os TIP127
   __delay_cycles(1000);
    lcdInit(PCF8574_LCD1);                  // Funcao que inicializa o LCD
    lcdLayout(PCF8574_LCD1,defaut);                // Volta para o layout inicial do LCD
    oneWireConfig();                           // Configurando pinos para comunicacao One Wire
    readPCF8574(ADDR_SNIVEL );               //  Importante. Faz uma leitura do PCF dos sensores de nivel para poder resetar a interrupcao( pino 13) caso esteja ativa.
    ta0Config();                            // Funcao que configura o Timer A0.
  //  ina219mode( 0x40, powerdown);           // 000: Power-Down mode reduces the quiescent current and turns off
  //  ina219config(0x40, 0x019F);             // ina219config( 0x40, 0b0001100110011111) -> PGA = 00 => 40mV / 0.1 ohm = 400 mA de corrente máxima esperada
    // ina219config( 0x40, 0b0000000110011111) ->
  //  ina219calibration(0x40);                // Escreve no endereco do registrador de calibragem do ina219, utilizando a equacao
    // cal = 0,04096/(current_LSB*Rshunt). Esta como current_LSB = 20 uA/bit e Rshunt= 0.1 ohm
    // i2cScanner
    tb0_ultrassom_config();                 // Configuraeheho do TB0 para o trigger do SU
    ta2_ultrassom_config();                 //
    uartConfig(1);                          // TERMINAL - Solititar comunicacao serial pelo. P4.5 = UCA1RXD. P4.4 = UCA1TXD. 1 = UCA1,
    uartConfig(0);                          // ESP32 - Solititar comunicacao serial pelo. P3.4 = UCA0RXD. P3.3 = UCA0TXD. 0 = UCA0,

    monNivelAB_1_2();                       // Monitorar niveis ao inicializar
    uartMonitorAmbar();                     //

    while(1)
    {

//        read_PCF8574 = UCB1RXBUF;
//        UCB1IFG &= ~UCRXIFG;                  // Clear USCI_B1 RX int flag
//        UCB1IFG &= ~UCTXIFG;                  // Clear USCI_B1 TX int flag
//        UCB1CTL1 |= UCTXSTP;                  // I2C stop condition
        if(countExit <= 0)
        {
            flagClrBuff = 1;
        }
        if (flagOpCmd == 1)                 // Flag alterada pela interrupcao pela uart
        {
            // Colocar como task de alta prioridade
            uart_operador_ambar5529();      //
        }
        if( atualizarUart & (!(flagTvalve)) == 1)
        {
            // Task de prioridade idle
            uartMonitorAmbar();             // Tela de monitoramento no terminal
            atualizarUart = 0;
        }
        if(flag_1_sec & atualizarLCD)
        {
            // lcd_T1Tool = 1 --> T1 enchendo
            // "evap_T1" (lcd_T1Tool=2) --> Timer de evaporacao
            // lcd_T1Tool = 3 --> Evap OK/Pronto para receber nutrientes
            // lcd_T1Tool = 4 --> T1 regando
            // lcd_T1Tool = 5 --> T1 vazio
            // lcd_T1Tool = 6 --> Erro no T1

            if(flagTvalve)
            {
               // ina219Print(ina219, 4);
                volatile static int tValve = 13;
                if(--tValve <= 0)
                {
                    //   operador_info(0x27);         // Atualiza o estado dos tanques
                    i2cWriteByte_UCB1( PCF8574_valves , 0xFF);          // Desativar todos os TIP127
                    __delay_cycles(1000);
                    lcdLayout(PCF8574_LCD1,defaut);                // Volta para o layout inicial do LCD
                    atualizarUart = 1;
                    flagTvalve = 0;
                    tValve = 13;
                }
            }
            else
            {
                lcdWriteByte(PCF8574_LCD1,0x0C, 0);      // Desligar o cursor e o blink 0  0  0  0  1  D  C  B,
                static volatile int refresh = 2;
                if(refresh-- <= 0)
                {
                    operador_LCD(0x27);         // Atualiza o sistema sobre estado dos tanques
                    refresh = 2;
                }
                sNivel();           // Tratamento de rebotes do SU e dos sensores de nehvel do tanque 1
                evapTimer_T1();
                evapTimer_T2();
              //  ina219Print(ina219, 3);
                operador_SU();
                // Enviando nivel dos tanques para o ESP32 (addr 0x42)
                // i2cWriteByte_UCB0(0x42, 1);
                //                TXESP32Data = 0xFF;
                //                TXByteCtr = 1;
                //               // while (UCB0CTL1 & UCTXSTP);             // Ensure stop condition got sent
                //                UCB0CTL1 |= UCTR + UCTXSTT;             // I2C TX, start condition
                //                //i2cWriteByte_UCB0(0x42, s1_Ultra);
                //                TXESP32Data = s1_Ultra;
                //                TXByteCtr = 1;
                //                //while (UCB0CTL1 & UCTXSTP);             // Ensure stop condition got sent
                //                UCB0CTL1 |= UCTR + UCTXSTT;             // I2C TX, start condition
                //
                //                //i2cWriteByte_UCB0(0x42, 2);
                //                TXESP32Data = 0x04;
                //                TXByteCtr = 1;
                //              //  while (UCB0CTL1 & UCTXSTP);             // Ensure stop condition got sent
                //                UCB0CTL1 |= UCTR + UCTXSTT;             // I2C TX, start condition
                //                //i2cWriteByte_UCB0(0x42, s2_Ultra);
                //                TXESP32Data = s2_Ultra;
                //                TXByteCtr = 1;
                //               // while (UCB0CTL1 & UCTXSTP);             // Ensure stop condition got sent
                //UCB0CTL1 |= UCTR + UCTXSTT;             // I2C TX, start condition
                operador_T1_T2();
            }
            flag_1_sec = 0;
            volatile static int flag_5_sec = 5;
            if(flag_5_sec-- <= 0)
            {
                flag_5_sec = 5;
                serial_esp32();
                read_temp();
            }
            volatile static int flag_60_sec = 60;
            if(flag_60_sec-- <= 0)
            {
                flag_60_sec = 60;
                lcdInit(PCF8574_LCD1);
                lcdLayout(PCF8574_LCD1,defaut);                // Volta para o layout inicial do LCD

