openpapaya/AMBAR/CTP_MSP430F5529/CTP_MSP430F55229.c
            }
        }
    } // while
} // int main


// ------------------------ Roteiro de decisoes -----------------------------------------
//      - A regra aqui eh que nenhuma linha tenha mais que um estado diferente em relacao eh linha anterior, para evitar sinalizaehehes simutaneas
//      - eh assumido que os tanques possuem volume suficiente para o tempo de rega ser maior que o tempo de evaporacao de cloro

//        agua no T1| agua no T2 | Enchendo T1| Enchendo T2 | Evaporando cloro T1 | Evaporando cloro  T2 | Ok para regar por T1 | Ok para regar pot T2 | saida ON T1 | saida ON T2
//  Na inicializacao:

//          T1 VAZIO, T2 CHEIO       :      0       0       0       0       0       0       0       0       0       0       *Estado 1*
//
//          T1 CHEIO, T2 VAZIO       :      0       0       0       0       0       0       0       0       0       0       *Estado 1*
//          T1 CHEIO, T2 CHEIO       :      0       0       0       0       0       0       0       0       0       0       *Estado 1*


//                                                  T1.agua|T2.agua|Ench_T1|Ench_T2|Evap_T1|Evap_T2|RegT1ok|RegT2ok|saidaT1|saidaT2
//        T1 VAZIO, T2 VAZIO                    :      0       0       0       0       0       0       0       0       0       0       *Estado 1*   T1 VAZIO, T2 VAZIO
//  Abrir registro de entrada do T1             :      0       0      -1-      0       0       0       0       0       0       0       *Estado 2*
//        T1 acabou de encher                   :     -1-      0       1       0       0       0       0       0       0       0       *Estado 3*
//  Fechar registro de entrada do T1            :      1       0      -0-      0       0       0       0       0       0       0       *Estado 4*
//  Iniciando evaporacao de cloro do T1         :      1       0       0       0      -1-      0       0       0       0       0       *Estado 5*
//  Finalizada evaporacao pelo T1               :      1       0       0       0       1       0      -1-      0       0       0       *Estado 6*
//  Abrir registro de saida do T1               :      1       0       0       0       1       0       1       0      -1-      0       *Estado 7*
//  Abrir registro de entrada do T2             :      1       0       0      -1-      1       0       1       0       1       0       *Estado 8*
//        T2 acabou de encher                   :      1      -1-      0       1       1       0       1       0       1       0       *Estado 9*
//  Fechar registro de entrada do T2            :      1       1       0      -0-      1       0       1       0       1       0       *Estado 10*
//  Iniciando evaporacao de cloro do T2         :      1       1       0       0       1      -1-      1       0       1       0       *Estado 11*
//  Finalizada evaporacao pelo T2               :      1       1       0       0       1       1       1      -1-      1       0       *Estado 12*
//  T1 VAZIO, T2 CHEIO                          :     -0-      1       0       0       1       1       1       1       1       0       *Estado 13*  T1 VAZIO, T2 CHEIO
//  Fechar registro de saida do T1              :      0       1       0       0       1       1       1       1      -0-      0       *Estado 14*
//  Zerar timer de evaporacao de cloro em T1    :      0       1       0       0      -0-      1       1       1       0       0       *Estado 16*
//  T1 nao autorizado para regar                :      0       1       0       0       0       1      -0-      1       0       0       *Estado 17*
//  Abrir registro de entrada do T1             :      0       1      -1-      0       0       1       0       1       0       0       *Estado 15*
//  Abrir registro de saida do T2               :      0       1       1       0       0       1       0       1       0      -1-      *Estado 18*
//        T1 acabou de encher                   :     -1-      1       1       0       0       1       0       1       0       1       *Estado 19*
//  Fechar registro de entrada do T1            :      1       1      -0-      0       0       1       0       1       0       1       *Estado 20*
//  Iniciando evaporacao de cloro do T1         :      1       1       0       0      -1-      1       0       1       0       1       *Estado 21*
//  Finalizada evaporacao pelo T1               :      1       1       0       0       1       1      -1-      1       0       1       *Estado 22*
//  T1 CHEIO, T2 VAZIO                          :      1      -0-      0       0       1       1       1       1       0       1       *Estado 23*  T1 CHEIO, T2 VAZIO
//  Fechar registro de saida do T2              :      1       0       0       0       1       1       1       1       0      -0-      *Estado 24*
//  Zerar timer de evaporacao de cloro em T2    :      1       0       0       0       1      -0-      1       1       0       0       *Estado 25*
//  T2 nao autorizado para regar                :      1       0       0       0       1       0      -0-      1       0       0       *Estado 26*
//  Abrir registro de entrada do T2             :      1       0       0      -1-      1       0       0       1       0       0       *Estado 27*
//  Abrir registro de saida do T1               :      1       0       0       1       1       0       0       1      -1-      0       *Estado 28*
//        T2 acabou de encher                   :      1      -1-      0       1       1       0       0       1       1       0       *Estado 29*
//  Fechar registro de entrada do T2            :      1       1       0      -0-      1       0       0       1       1       0       *Estado 30*
//  Iniciando evaporacao de cloro do T2         :      1       1       0       0       1      -1-      0       1       1       0       *Estado 31*
//  Finalizada evaporacao pelo T2               :      1       1       0       0       1       1      -1-      1       1       0       *Estado 32*
//  T1 CHEIO, T2 CHEIO                          :      1       1       0       0       1       1       1       1       1       0       *Estado 33*  T1 CHEIO, T2 CHEIO escolhido nesse estado para ficar compativel com o o mesmo estado de inicializacao quando T1 CHEIO e T2 CHEIO, em que T1 devereh ser o primeiro a regar

//                NivelA1|NivelB1|NivelA2|NivelB2|| V.IN1 | VOUT1 | V.IN2 | VOUT2 ||         T1    |    T2    ||regT1ok|regT2ok|t1_regar|t2_regar|
//                   0       0       0       0   ||     ERROR     |     ERROR     || -->  ERRO T1  | ERRO T2  ||   x   |   x   |   x    |   x    |
//                   0       0       0       1   ||     ERROR     |       |   1   || -->  ERRO T1  | T2 CHEIO ||   x   |   1   |   x    |   1    |
//                   0       0       1       0   ||     ERROR     |   1   |       || -->  ERRO T1  | T2 VAZIO ||   x   |   0   |   x    |   0    |
//                   0       0       1       1   ||     ERROR     |       |   1   || -->  ERRO T1  | T2 CHEIO ||   x   |   1   |   x    |   1    |
//                   0       1       0       0   ||   0   |   1   |     ERROR     || -->  T1 CHEIO | ERRO T2  ||   1   |   x   |   1    |   x    |
//                   0       1       0       1   ||   0   |   1   |   0   |   0   || -->  T1 CHEIO | T2 CHEIO ||   1   |   1   |   1    |   0    |
//                   0       1       1       0   ||   0   |   1   |   1   |   0   || -->  T1 CHEIO | T2 VAZIO ||   1   |   0   |   1    |   0    |
//                   0       1       1       1   ||   0   |   0   |   0   |   1   || -->  T1 CHEIO | T2 CHEIO ||   1   |   1   |   1    |   0    |
//                   1       0       0       0   ||   1   |   0   |     ERROR     || -->  T1 CHEIO | T2 CHEIO ||   1   |   1   |   1    |   0    |
//                   1       0       0       1   ||   1   |   0   |   0   |   1   || -->  T1 VAZIO | T2 CHEIO ||   0   |   1   |   0    |   1    |
//                   1       0       1       0   ||   1   |   0   |   0   |   0   || -->  T1 VAZIO | T2 VAZIO ||   0   |   0   |   0    |   0    |
//                   1       0       1       1   ||   1   |   0   |   0   |   1   || -->  T1 VAZIO | T2 CHEIO ||   0   |   1   |   0    |   1    |
//                   1       1       0       0   ||   0   |   1   |     ERROR     || -->  T1 CHEIO | ERRO T2  ||   1   |   x   |   1    |   x    |
//                   1       1       0       1   ||   0   |   1   |   0   |   0   || -->  T1 CHEIO | T2 CHEIO ||   1   |   1   |   1    |   0    |
//                   1       1       1       0   ||   0   |   1   |   1   |   0   || -->  T1 CHEIO | T2 VAZIO ||   1   |   0   |   1    |   0    |
//                   1       1       1       1   ||   1   |   0   |   0   |   0   || -->  T1 CHEIO | T2 CHEIO ||   1   |   1   |   1    |   0    |

//    _____________               AB
//    |-----------|--> Nivel A    01
//    |-----------|
//    |-----------|               11
//    |-----------|
//    |___________|--> Nivel B    10
//                            00 == ERRO
//----------------------------------
// PH:
//
// Com o pH errado, metade dos nutrientes recomendados serÃ¡ suficiente para causar uma overfert.
// Com o pH certo, a dose mÃ¡xima recomendada de qualquer nutriente farÃ¡ as plantas crescerem saudÃ¡veis â€‹â€‹e fortes, aproveitando-os ao mÃ¡ximo.
//
// ----------------------------------
// Condutividade ElÃ©trica:
//
//EC stands for Electrical Conductivity. This measures the amount of nutrients (salts) in the water.
// The higher the EC, the more salt is in the water.
// This is important because too much or too little nutrients can harm the plants.
// Para saber se vocÃª estÃ¡ usando muito ou pouco fertilizante, Ã© preciso monitorar o valor da EC da soluÃ§Ã£o de Ã¡gua + nutrientes.
// Partindo, por exemplo, de uma soluÃ§Ã£o com concentraÃ§Ã£o de 1,0, Ã© preciso avaliar no dia seguinte Ã  rega se o valor de EC aumentou ou diminuiu.
// Supondo que apÃ³s a rega a leitura da Ã¡gua seja de 1,4 , isto significa que a soluÃ§Ã£o inicial estava muito concentrada,
// ou seja, Ã© preciso dissolver a quantidade de nutrientes adicionado com a adiÃ§Ã£o de mais Ã¡gua. Se no dia seguinte o valor da EC estiver 0,7,
// por exemplo, a planta absorveu os nutrientes mais rapidamente do que a Ã¡gua. Portanto, pode-se aumentar a quantidade de nutrientes.
// Electrical conductivity is measure of the ionic strength of a solution and can be converted into concentration.
// -----------------------------------
// Total de SÃ³lidos Dissolvidos (TDS)
//
// Since the conductivity of a nutrient solution is related to the concentration of dissolved solids present,
// conductivity readings can also be expressed as total dissolved solids (TDS). The measurement of TDS indicates the amount of ions dissolved in a solution.
// In terms of hydroponics, TDS specifies the salt concentration and strength of a nutrient solution.
// A true mass measurement of TDS is determined by a gravimetric analysis.
// However, an estimated measurement of TDS can more quickly and simply be extrapolated from an EC measurement.
// ----------------------------------
// OxigÃªnio Dissolvido:
//
// DO stands for dissolved oxygen and measures how much oxygen is dissolved in the water.
// The higher the DO, the more oxygen is available for plants. This is important for plant respiration.
// ----------------------------------
// Temperatura (ÂºC)
//
// Temperature is important to measure because it affects how much oxygen is dissolved in the water. The warmer the water, the less dissolved oxygen there is.
// The temperature affects all these chemical reactions and should be monitored to ensure that the plants are not too hot or too cold.
//
// EC and pH are important because they affect how well plants absorb nutrients.
// DO is crucial because it affects how much oxygen plants have available to them.
// Temperature is critical because it can affect plant metabolism.
// Ensure to keep the roots of the plants submerged in water at all times.
// This will help prevent oxygen depletion and keep the roots cooler, which is vital for plant growth.
// It would be best if you recirculated the nutrient solution regularly. This will help to keep the concentrations of nutrients and dissolved oxygen at optimal levels.
// You should monitor the temperature of the hydroponic system closely. It can adversely affect plant growth if it gets too hot or too cold.
